Predefined:

```
~/cf-repos/github/tf-migrate vaishak/zt-dlp-profile !4 ?4 ❯ TF_MIG_TEST=true ./scripts/run-e2e-tests.sh --apply-exemptions --provider /Users/vaishak/cf-repos/github/terraform-provider-cloudflare --resources zero_trust_dlp_predefined_profile
Building binaries...
go build -v -o bin/tf-migrate ./cmd/tf-migrate
go build -v -o bin/e2e-runner ./cmd/e2e-runner


========================================
State Migration Methods for Specified Resources
========================================

Resources using provider's UpgradeState/MoveState:
  zero_trust_dlp_predefined_profile

Targeting specific resources: zero_trust_dlp_predefined_profile
Target arguments: -target=module.zero_trust_dlp_predefined_profile


========================================
E2E Migration Test
========================================

Step 0: Initializing test resources
Running tests with:
  User:       vaishak@cloudflare.com
  Account ID: 8511639f53e8d7871003f714afd1dba4
  Zone ID:    b9c9ae341a26b5b692441bb6573015b9
  Domain:     vaishak.terraform.cfapi.net
  Provider:   Local (/Users/vaishak/cf-repos/github/terraform-provider-cloudflare)

Running init script...

========================================
Syncing Test Resources
========================================

Filtering to specific resources: zero_trust_dlp_predefined_profile
Syncing resource files from testdata...
  ✓ zero_trust_dlp_predefined_profile/zero_trust_dlp_predefined_profile.tf (from zero_trust_dlp_predefined_profile_e2e.tf)
  ✓ zero_trust_dlp_predefined_profile/versions.tf

  Total: 2 files synced

Configuring terraform variables...


✓ Saved configuration
    Account ID: 8511639f53e8d7871003f714afd1dba4
    Zone ID: b9c9ae341a26b5b692441bb6573015b9
    Domain: vaishak.terraform.cfapi.net
    File: v4/terraform.tfvars

Scanning for import annotations...
  ✓ Found 1 resource(s) requiring import
    - module.zero_trust_dlp_predefined_profile.cloudflare_dlp_profile.credentials_and_secrets

Updating main.tf with module references...
  ↻ Updated main.tf with 1 module references and 1 import blocks


========================================
✓ Sync Complete!
========================================

Summary:
  - Terraform v4 configs: /Users/vaishak/cf-repos/github/tf-migrate/e2e/tf/v4
  - Modules: 1
  - Files synced: 2

Configuring remote backend...
✓ Backend configured

  ✓ Provider installation preserved
  ✓ Backend already configured

Next steps:
  cd tf/v4 && terraform apply

Note: Configuration is automatically loaded from terraform.tfvars
      State is managed remotely in R2

✓ Test resources initialized


========================================
Setting up local provider
========================================

Using provider from: /Users/vaishak/cf-repos/github/terraform-provider-cloudflare
Building provider...
  Building in: /Users/vaishak/cf-repos/github/terraform-provider-cloudflare
  Output: /Users/vaishak/cf-repos/github/terraform-provider-cloudflare/terraform-provider-cloudflare
✓ Provider built successfully: /Users/vaishak/cf-repos/github/terraform-provider-cloudflare/terraform-provider-cloudflare
✓ Created dev overrides config: /Users/vaishak/cf-repos/github/tf-migrate/.terraformrc-tf-migrate
✓ Local provider will be used for v5 testing

Note: v4 tests will use the registry provider (v4.x)
      v5 tests will use the local provider with dev overrides

Step 1: Testing v4 configurations
Running terraform init in v4/...
Found local state file, backing up and using remote state...
✓ Terraform init successful (remote state loaded from R2)
Running terraform plan in v4/...
✓ Terraform plan successful
  Plan: 0 to add, 1 to change, 0 to destroy.

Detailed changes:

  # module.zero_trust_dlp_predefined_profile.cloudflare_dlp_profile.credentials_and_secrets will be updated in-place
  ~ resource "cloudflare_dlp_profile" "credentials_and_secrets" {
      ~ allowed_match_count = 3 -> 0
        id                  = "c8932cc4-3312-4152-8041-f3f257122dc4"
        name                = "Credentials and Secrets"
        # (3 unchanged attributes hidden)


Running terraform apply in v4/...
✓ Terraform apply successful
  Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
Syncing state from remote...
✓ Local state file synced from R2
Capturing v4 state...
✓ Saved v4 state to tmp/v4-state.json


Step 2: Running migration
Running ./scripts/migrate...
Building tf-migrate binary...
✓ Binary built successfully

========================================
Running v4 to v5 Migration
========================================

Preparing output directory...
  ✓ Preserved v5 provider installation (.terraform/)
  ✓ Preserved v5 dependency lock file (.terraform.lock.hcl)
Copying only targeted resources: zero_trust_dlp_predefined_profile
    ✓ Copied root file: provider.tf
    ✓ Copied root file: terraform.tfvars
    ✓ Copied root file: terraform.tfstate

    ✓ Copied module: zero_trust_dlp_predefined_profile
Creating filtered main.tf...
✓ Copied targeted resources to migrated-v4_to_v5/
✓ Updated provider.tf to use ~> 5.0 and removed backend config
Filtering state file to only include targeted resources...
✓ Filtered state to 1 resources from targeted modules

Migrating configuration files...
Skipping state transformation - using provider's state upgrader
Cloudflare Terraform Provider Migration Tool
============================================

Configuration directory: /Users/vaishak/cf-repos/github/tf-migrate/e2e/migrated-v4_to_v5
Output directory: in-place
✓ Using Cloudflare API credentials (API key + email)

Found 4 configuration files to migrate
[1/4] Processing main.tf... ✓
[2/4] Processing provider.tf... ✓
[3/4] Processing versions.tf... ✓
[4/4] Processing zero_trust_dlp_predefined_profile.tf... ✓
2026-02-18T15:49:22.176-0800 [WARN]  tf-migrate: Migrator does not implement ResourceRenamer interface - cross-file references may not be updated: migrator="*zone_setting.V4ToV5Migrator"
2026-02-18T15:49:22.176-0800 [WARN]  tf-migrate: Migrator does not implement ResourceRenamer interface - cross-file references may not be updated: migrator="*zero_trust_split_tunnel.V4ToV5Migrator"
2026-02-18T15:49:22.176-0800 [WARN]  tf-migrate: Migrator does not implement ResourceRenamer interface - cross-file references may not be updated: migrator="*zero_trust_gateway_certificate.V4ToV5Migrator"
2026-02-18T15:49:22.176-0800 [WARN]  tf-migrate: Migrator does not implement ResourceRenamer interface - cross-file references may not be updated: migrator="*rulesets.V4ToV5Migrator"
2026-02-18T15:49:22.176-0800 [WARN]  tf-migrate: Migrator does not implement ResourceRenamer interface - cross-file references may not be updated: migrator="*load_balancer_pools.V4ToV5Migrator"
2026-02-18T15:49:22.176-0800 [WARN]  tf-migrate: Migrator does not implement ResourceRenamer interface - cross-file references may not be updated: migrator="*queue.V4ToV5Migrator"

Applying cross-file reference updates (29 updates across 4 files)...
✓ Updated cross-file references (29 updates applied)
✓ Migration complete (config transformed, state will be upgraded by provider)
  ✓ Applied post-migration patch to zero_trust_dlp_predefined_profile/zero_trust_dlp_predefined_profile.tf


========================================
✓ Migration Complete!
========================================

Results:
  Input (v4):  /Users/vaishak/cf-repos/github/tf-migrate/e2e/tf/v4
  Output (v5): /Users/vaishak/cf-repos/github/tf-migrate/e2e/migrated-v4_to_v5

Next steps:
  cd /Users/vaishak/cf-repos/github/tf-migrate/e2e/migrated-v4_to_v5
  terraform init
  terraform plan

✓ Migration successful

Step 3: Testing v5 configurations
Running terraform init in migrated-v4_to_v5/...
Cleaning v5 .terraform directory for fresh init...
Removing .terraform.lock.hcl to allow dev_overrides...
✓ Terraform init successful
Running terraform plan in v5/...
✓ Terraform plan shows only computed value refreshes (ignored with --apply-exemptions)

Drift exemptions applied:
  - enabled_entries_empty_to_null: 1 change(s) exempted
  - computed_value_refreshes: 3 change(s) exempted
Running terraform apply in v5/...
✓ Terraform apply successful
Capturing v5 state...
✓ Saved v5 state to tmp/v5-state.json

Step 4: Verifying stable state (v5 plan after apply)
Running terraform plan again to check for ongoing drift...
✓ Only computed value refreshes detected (ignored with --apply-exemptions) - migration achieved stable state!

Drift exemptions applied:
  - enabled_entries_empty_to_null: 1 change(s) exempted
  - computed_value_refreshes: 3 change(s) exempted


========================================
Drift Report
========================================

✓ Exempted changes in v5 plan (before apply):
The following changes were detected but exempted by drift exemption rules:
  module.zero_trust_dlp_predefined_profile.cloudflare_zero_trust_dlp_predefined_profile.credentials_and_secrets:
    - enabled_entries      = [] -> null [exempted: enabled_entries_empty_to_null]
  module.zero_trust_dlp_predefined_profile.cloudflare_zero_trust_dlp_predefined_profile.credentials_and_secrets:
    ~ entries              = [] -> (known after apply) [exempted: computed_value_refreshes]
  module.zero_trust_dlp_predefined_profile.cloudflare_zero_trust_dlp_predefined_profile.credentials_and_secrets:
    ~ name                 = "Credentials and Secrets" -> (known after apply) [exempted: computed_value_refreshes]
  module.zero_trust_dlp_predefined_profile.cloudflare_zero_trust_dlp_predefined_profile.credentials_and_secrets:
    ~ open_access          = false -> (known after apply) [exempted: computed_value_refreshes]

✓ Exempted changes in v5 plan (after apply):
The following changes were detected but exempted by drift exemption rules:
  module.zero_trust_dlp_predefined_profile.cloudflare_zero_trust_dlp_predefined_profile.credentials_and_secrets:
    ~ name                 = "Credentials and Secrets" -> (known after apply) [exempted: computed_value_refreshes]
  module.zero_trust_dlp_predefined_profile.cloudflare_zero_trust_dlp_predefined_profile.credentials_and_secrets:
    ~ open_access          = false -> (known after apply) [exempted: computed_value_refreshes]
  module.zero_trust_dlp_predefined_profile.cloudflare_zero_trust_dlp_predefined_profile.credentials_and_secrets:
    - enabled_entries      = [] -> null [exempted: enabled_entries_empty_to_null]
  module.zero_trust_dlp_predefined_profile.cloudflare_zero_trust_dlp_predefined_profile.credentials_and_secrets:
    ~ entries              = [] -> (known after apply) [exempted: computed_value_refreshes]



========================================
✓ E2E Test Complete!
========================================

Summary:

  Step 1: v4 terraform apply
    Status: ✓ SUCCESS

  Step 2: Migration (v4 → v5)
    Status: ✓ SUCCESS

  Step 3: v5 plan (before apply)
    Status: ⚠ Changes detected but all exempted
    Result: 0 real changes (4 exempted)
    Terraform: Plan: 0 to add, 1 to change, 0 to destroy.

  Step 4: v5 terraform apply
    Status: ✓ SUCCESS

  Step 5: v5 plan (after apply)
    Status: ✓ SUCCESS - Stable state achieved
    Result: No changes detected

Logs saved to:
  - /Users/vaishak/cf-repos/github/tf-migrate/e2e/tmp

```